Revit 2027 API
ElectricalSystem.CableSize Property
 The Cable Size of the Electrical System.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId CableSize { get; set; }
Public Property CableSize As ElementId
	Get
	Set
public:
property ElementId^ CableSize {
	ElementId^ get ();
	void set (ElementId^ value);
}
member CableSize : ElementId with get, set
Property Value
ElementId
Exceptions
Exception | Condition
ArgumentException |  When setting this property: The id is not a Cable Size id nor invalidElementId. -or- When setting this property: The Cable Size can not be used by the current Cable Type.
ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
Reference
ElectricalSystem Class
Autodesk.Revit.DB.Electrical Namespace